src/cf/src/InformationRegisters/ЗагрузкаСтанков/ЗагрузкаСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗагрузкаСтанков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.ВидыЗагрузкиСтанков</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Catalogs/ПроизводственноеОборудование/ПроизводственноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводственноеОборудование</name>
  <attributes>
    <name>ВидСтанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаСменуЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладСтанка</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Выведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаетБезКалендаря</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Круглосуточно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/CommonModules/ЗагрузкаСтанков/Module.bsl
// Учёт станков: рабочее время по режиму станка и производственному календарю, загрузка станков и проверка
// пересечения интервалов. Интервалы везде полуоткрытые: [Начало, Окончание).
//
#Область ПрограммныйИнтерфейс

// Рабочие интервалы станков за период по режиму работы. День производственного календаря у станка без флажка
// «Работает без производственного календаря» нерабочий: смены, начатые в этот день, в интервалы не входят. Смена
// относится к дню своего начала, смена через полночь заканчивается на следующий день. Пересекающиеся смены
// одного станка (например, ночная смена понедельника и утренняя вторника) сливаются.
//
// Параметры:
//  Станки    - Массив из СправочникСсылка.ПроизводственноеОборудование - станки
//  Начало    - Дата - начало периода, включается
//  Окончание - Дата - конец периода, не включается
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Станок, Начало, Окончание (Дата), упорядочена по станку и началу
//
Функция ИнтервалыРаботыСтанков(Станки, Начало, Окончание) Экспорт

	Интервалы = НоваяТаблицаИнтервалов();
	Если Окончание <= Начало Или Станки.Количество() = 0 Тогда
		Возврат Интервалы;
	КонецЕсли;

	// Смена вчерашнего дня через полночь заходит в период, поэтому обход начинается на день раньше.
	ПервыйДень = НачалоДня(Начало) - СекундВСутках();
	Выходные = РегистрыСведений.ПроизводственныйКалендарь.ПолучитьВыходные(ПервыйДень, Окончание);
	РежимыСтанков = РежимыРаботы(Станки);

	Для Каждого Станок Из Станки Цикл
		Режим = РежимыСтанков.Получить(Станок);
		Если Режим = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СменыСтанка = НоваяТаблицаИнтервалов();
		День = ПервыйДень;
		Пока День < Окончание Цикл
			Смены = Режим.Смены.Получить(ДеньНедели(День));
			Если Смены <> Неопределено И Не (Режим.УчитыватьКалендарь И Выходные.Найти(День) <> Неопределено) Тогда
				ДобавитьСменыДня(СменыСтанка, Станок, День, Смены, Начало, Окончание);
			КонецЕсли;
			День = День + СекундВСутках();
		КонецЦикла;
		ДобавитьСлитыеИнтервалы(Интервалы, СменыСтанка);
	КонецЦикла;

	Возврат Интервалы;

КонецФункции

// Рабочие интервалы одного станка за период, см. ИнтервалыРаботыСтанков.
//
// Параметры:
//  Станок    - СправочникСсылка.ПроизводственноеОборудование - станок
//  Начало    - Дата - начало периода, включается
//  Окончание - Дата - конец периода, не включается
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Станок, Начало, Окончание
//
Функция ИнтервалыРаботыСтанка(Станок, Начало, Окончание) Экспорт

	Станки = Новый Массив;
	Станки.Добавить(Станок);
	Возврат ИнтервалыРаботыСтанков(Станки, Начало, Окончание);

КонецФункции

// Фонд рабочего времени станка за период: сумма рабочих интервалов по режиму и календарю.
//
// Параметры:
//  Станок    - СправочникСсылка.ПроизводственноеОборудование - станок
//  Начало    - Дата - начало периода, включается
//  Окончание - Дата - конец периода, не включается
//
// Возвращаемое значение:
//  Число - часы
//
Функция ФондВремениСтанка(Станок, Начало, Окончание) Экспорт

	Возврат ЧасыИнтервалов(ИнтервалыРаботыСтанка(Станок, Начало, Окончание));

КонецФункции

// Сумма часов интервалов таблицы.
//
// Параметры:
//  Интервалы - ТаблицаЗначений, Массив из СтрокаТаблицыЗначений - строки с колонками Начало и Окончание
//
// Возвращаемое значение:
//  Число - часы
//
Функция ЧасыИнтервалов(Интервалы) Экспорт

	Секунд = 0;
	Для Каждого Интервал Из Интервалы Цикл
		Секунд = Секунд + (Интервал.Окончание - Интервал.Начало);
	КонецЦикла;
	Возврат Секунд / СекундВЧасе();

КонецФункции

// Длительность интервала в часах, округлённая до сотых, - так её хранит регистр «Загрузка станков».
//
// Параметры:
//  Начало    - Дата - начало интервала
//  Окончание - Дата - конец интервала, не включается
//
// Возвращаемое значение:
//  Число - часы
//
Функция ЧасыМеждуДатами(Начало, Окончание) Экспорт

	Возврат ОкруглитьЧасы((Окончание - Начало) / СекундВЧасе());

КонецФункции

// Часы, округлённые до сотых, как в регистре «Загрузка станков» и в отчётах.
//
// Параметры:
//  Часы - Число - часы
//
// Возвращаемое значение:
//  Число - округлённые часы
//
Функция ОкруглитьЧасы(Часы) Экспорт

	Возврат Окр(Часы, ЗнаковЧасов());

КонецФункции

// Секунд в сутках - шаг дней планировщика и режима работы.
//
// Возвращаемое значение:
//  Число - 86400
//
Функция СекундВСутках() Экспорт

	Возврат 86400;

КонецФункции

// Сколько часов интервала [Начало, Окончание) приходится на рабочие интервалы станка.
//
// Параметры:
//  Интервалы - ТаблицаЗначений, Массив из СтрокаТаблицыЗначений - рабочие интервалы одного станка
//  Начало    - Дата - начало интервала
//  Окончание - Дата - конец интервала, не включается
//
// Возвращаемое значение:
//  Число - часы
//
Функция ЧасыВРабочееВремя(Интервалы, Начало, Окончание) Экспорт

	Секунд = 0;
	Для Каждого Интервал Из Интервалы Цикл
		ИнтервалС = Макс(Интервал.Начало, Начало);
		ИнтервалПо = Мин(Интервал.Окончание, Окончание);
		Если ИнтервалПо > ИнтервалС Тогда
			Секунд = Секунд + (ИнтервалПо - ИнтервалС);
		КонецЕсли;
	КонецЦикла;
	Возврат Секунд / СекундВЧасе();

КонецФункции

// Записи загрузки станка, с которыми конфликтует новый интервал. Конфликт - пересечение во времени с записью
// другого регистратора того же станка, если обе записи плановые (любого вида) или обе фактические одного вида
// («Работа» с «Работой», «Обслуживание» с «Обслуживанием»). Фактическое обслуживание поверх фактической работы
// допустимо: авария случается посреди загрузки. План с фактом не сверяется: план потом переносится.
// Вызывать под блокировкой загрузки станка (УправляемыеБлокировки.ЗагрузкаСтанков).
//
// Параметры:
//  Станок      - СправочникСсылка.ПроизводственноеОборудование - станок
//  Начало      - Дата - начало интервала
//  Окончание   - Дата - конец интервала, не включается
//  ВидЗаписи   - ПеречислениеСсылка.ВидыЗагрузкиСтанков - вид новой записи
//  План        - Булево - новая запись плановая
//  Регистратор - ДокументСсылка - регистратор новой записи: его прежние записи не конфликтуют
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Регистратор, Начало, Окончание, ВидЗаписи, План
//
Функция ПересеченияЗагрузки(Станок, Начало, Окончание, ВидЗаписи, План, Регистратор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Загрузка.Регистратор КАК Регистратор,
	|	Загрузка.Начало КАК Начало,
	|	Загрузка.Окончание КАК Окончание,
	|	Загрузка.ВидЗаписи КАК ВидЗаписи,
	|	Загрузка.План КАК План
	|ИЗ
	|	РегистрСведений.ЗагрузкаСтанков КАК Загрузка
	|ГДЕ
	|	Загрузка.Станок = &Станок
	|	И Загрузка.Регистратор <> &Регистратор
	|	И Загрузка.Начало < &Окончание
	|	И Загрузка.Окончание > &Начало
	|	И Загрузка.План = &План
	|	И &УсловиеВида
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начало";
	// Плановые записи конфликтуют при любом виде, фактические - только одного вида.
	Если Не План Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВида", "Загрузка.ВидЗаписи = &ВидЗаписи");
	КонецЕсли;
	Запрос.УстановитьПараметр("УсловиеВида", Истина);
	Запрос.УстановитьПараметр("Станок", Станок);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Окончание", Окончание);
	Запрос.УстановитьПараметр("План", План);
	Запрос.УстановитьПараметр("ВидЗаписи", ВидЗаписи);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Текст отказа по пересечению загрузки станка для сообщения пользователю.
//
// Параметры:
//  Пересечение - СтрокаТаблицыЗначений - строка результата ПересеченияЗагрузки
//
// Возвращаемое значение:
//  Строка - текст
//
Функция ТекстПересеченияЗагрузки(Пересечение) Экспорт

	Шаблон = НСтр("ru = 'Станок занят: %1, %2 - %3';
		|fr = 'La machine est occupée : %1, %2 - %3';
		|en = 'The machine is busy: %1, %2 - %3';
		|es = 'La máquina está ocupada: %1, %2 - %3'");
	Возврат СтрШаблон(Шаблон, Пересечение.Регистратор, Формат(Пересечение.Начало, "ДФ='dd.MM.yyyy HH:mm'"),
		Формат(Пересечение.Окончание, "ДФ='dd.MM.yyyy HH:mm'"));

КонецФункции

// Предупреждение о незаполненном производственном календаре: у станка без флажка «Работает без производственного
// календаря» фонд за год без единой записи календаря молча считается без праздников и выходных. Календарь ведётся
// в «Производство → Нормативы» и в «Зарплата и кадры».
//
// Параметры:
//  Станки    - Массив из СправочникСсылка.ПроизводственноеОборудование - станки
//  Начало    - Дата - начало периода
//  Окончание - Дата - конец периода, не включается
//
// Возвращаемое значение:
//  Строка - текст предупреждения; пустая строка - календарь заполнен или не нужен
//
Функция ТекстПустогоКалендаря(Станки, Начало, Окончание) Экспорт

	Если Окончание <= Начало Или Станки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Станки.Ссылка КАК Станок
	|ИЗ
	|	Справочник.ПроизводственноеОборудование КАК Станки
	|ГДЕ
	|	Станки.Ссылка В(&Станки)
	|	И НЕ Станки.РаботаетБезКалендаря";
	Запрос.УстановитьПараметр("Станки", Станки);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат "";
	КонецЕсли;

	Выходные = РегистрыСведений.ПроизводственныйКалендарь.ПолучитьВыходные(НачалоГода(Начало), КонецГода(Окончание - 1));
	ПустыеГоды = Новый Массив;
	Для НомерГода = Год(Начало) По Год(Окончание - 1) Цикл
		ГодЗаполнен = Ложь;
		Для Каждого День Из Выходные Цикл
			Если Год(День) = НомерГода Тогда
				ГодЗаполнен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ГодЗаполнен Тогда
			ПустыеГоды.Добавить(Формат(НомерГода, "ЧГ=0"));
		КонецЕсли;
	КонецЦикла;
	Если ПустыеГоды.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Шаблон = НСтр("ru = 'Производственный календарь на %1 не заполнен: фонд времени станков посчитан без праздников и выходных';
		|fr = 'Le calendrier de %1 n''est pas rempli : le temps disponible des machines est calculé sans jours fériés ni week-ends';
		|en = 'The working calendar for %1 is empty: machine available time is calculated without holidays and weekends';
		|es = 'El calendario laboral de %1 está vacío: el tiempo disponible se calcula sin festivos ni fines de semana'");
	Возврат СтрШаблон(Шаблон, СтрСоединить(ПустыеГоды, ", "));

КонецФункции

// Смена строки режима в секундах от начала дня. Окончание не позже начала - смена через полночь; равные
// начало и окончание (например, обе пустые - 00:00) без флажка «Круглосуточно» запрещает проверка заполнения
// станка, здесь они дают сутки, чтобы строка не пропала молча из старых данных. Одно правило для фонда и для
// проверки пересечения смен в карточке станка.
//
// Параметры:
//  НачалоСмены    - Дата - время начала
//  ОкончаниеСмены - Дата - время окончания
//  Круглосуточно  - Булево - смена на все сутки
//
// Возвращаемое значение:
//  Структура - НачалоСекунд, ОкончаниеСекунд
//
Функция СменаВСекундах(НачалоСмены, ОкончаниеСмены, Круглосуточно) Экспорт

	Если Круглосуточно Тогда
		Возврат Новый Структура("НачалоСекунд, ОкончаниеСекунд", 0, СекундВСутках());
	КонецЕсли;
	НачалоСекунд = НачалоСмены - НачалоДня(НачалоСмены);
	ОкончаниеСекунд = ОкончаниеСмены - НачалоДня(ОкончаниеСмены);
	Если ОкончаниеСекунд <= НачалоСекунд Тогда
		ОкончаниеСекунд = ОкончаниеСекунд + СекундВСутках();
	КонецЕсли;
	Возврат Новый Структура("НачалоСекунд, ОкончаниеСекунд", НачалоСекунд, ОкончаниеСекунд);

КонецФункции

// Почему нельзя выключить учёт станков. Точка расширения: со сборки требований-накладных здесь проверяется
// остаток материалов на станках; пока материалов на станках не бывает, запрета нет.
//
// Возвращаемое значение:
//  Строка - текст запрета; пустая строка - выключить можно
//
Функция ТекстЗапретаВыключенияУчета() Экспорт

	Возврат "";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Режимы работы станков одним запросом.
//
// Параметры:
//  Станки - Массив из СправочникСсылка.ПроизводственноеОборудование - станки
//
// Возвращаемое значение:
//  Соответствие - ключ: станок; значение: Структура:
//   * УчитыватьКалендарь - Булево - дни производственного календаря нерабочие
//   * Смены              - Соответствие - ключ: номер дня недели (1 - понедельник); значение: Массив из Структура
//                          с ключами НачалоСекунд, ОкончаниеСекунд (секунды от начала дня начала смены)
//
Функция РежимыРаботы(Станки)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Станки.Ссылка КАК Станок,
	|	НЕ Станки.РаботаетБезКалендаря КАК УчитыватьКалендарь,
	|	Режим.ДеньНедели КАК ДеньНедели,
	|	Режим.НачалоСмены КАК НачалоСмены,
	|	Режим.ОкончаниеСмены КАК ОкончаниеСмены,
	|	Режим.Круглосуточно КАК Круглосуточно
	|ИЗ
	|	Справочник.ПроизводственноеОборудование КАК Станки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПроизводственноеОборудование.РежимРаботы КАК Режим
	|		ПО (Режим.Ссылка = Станки.Ссылка)
	|ГДЕ
	|	Станки.Ссылка В(&Станки)
	|	И Режим.ДеньНедели <> ЗНАЧЕНИЕ(Перечисление.ДниНедели.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Станки", Станки);
	Выборка = Запрос.Выполнить().Выбрать();

	Режимы = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Режим = Режимы.Получить(Выборка.Станок);
		Если Режим = Неопределено Тогда
			Режим = Новый Структура("УчитыватьКалендарь, Смены", Выборка.УчитыватьКалендарь, Новый Соответствие);
			Режимы.Вставить(Выборка.Станок, Режим);
		КонецЕсли;
		НомерДня = Перечисления.ДниНедели.Индекс(Выборка.ДеньНедели) + 1;
		Смены = Режим.Смены.Получить(НомерДня);
		Если Смены = Неопределено Тогда
			Смены = Новый Массив;
			Режим.Смены.Вставить(НомерДня, Смены);
		КонецЕсли;
		Смены.Добавить(СменаВСекундах(Выборка.НачалоСмены, Выборка.ОкончаниеСмены, Выборка.Круглосуточно));
	КонецЦикла;
	Возврат Режимы;

КонецФункции

// Добавляет смены одного дня, обрезанные периодом.
//
// Параметры:
//  СменыСтанка - ТаблицаЗначений - см. НоваяТаблицаИнтервалов
//  Станок      - СправочникСсылка.ПроизводственноеОборудование - станок
//  День        - Дата - начало дня начала смены
//  Смены       - Массив из Структура - см. СменаВСекундах
//  Начало      - Дата - начало периода
//  Окончание   - Дата - конец периода, не включается
//
Процедура ДобавитьСменыДня(СменыСтанка, Станок, День, Смены, Начало, Окончание)

	Для Каждого Смена Из Смены Цикл
		ИнтервалС = Макс(День + Смена.НачалоСекунд, Начало);
		ИнтервалПо = Мин(День + Смена.ОкончаниеСекунд, Окончание);
		Если ИнтервалПо > ИнтервалС Тогда
			Строка = СменыСтанка.Добавить();
			Строка.Станок = Станок;
			Строка.Начало = ИнтервалС;
			Строка.Окончание = ИнтервалПо;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Сливает пересекающиеся и смежные интервалы одного станка и добавляет их в итоговую таблицу.
//
// Параметры:
//  Интервалы   - ТаблицаЗначений - итоговая таблица, см. НоваяТаблицаИнтервалов
//  СменыСтанка - ТаблицаЗначений - интервалы одного станка
//
Процедура ДобавитьСлитыеИнтервалы(Интервалы, СменыСтанка)

	СменыСтанка.Сортировать("Начало");
	Текущий = Неопределено;
	Для Каждого Смена Из СменыСтанка Цикл
		Если Текущий <> Неопределено И Смена.Начало <= Текущий.Окончание Тогда
			Текущий.Окончание = Макс(Текущий.Окончание, Смена.Окончание);
			Продолжить;
		КонецЕсли;
		Текущий = Интервалы.Добавить();
		ЗаполнитьЗначенияСвойств(Текущий, Смена);
	КонецЦикла;

КонецПроцедуры

Функция НоваяТаблицаИнтервалов()

	Интервалы = Новый ТаблицаЗначений;
	Интервалы.Колонки.Добавить("Станок", Новый ОписаниеТипов("СправочникСсылка.ПроизводственноеОборудование"));
	Интервалы.Колонки.Добавить("Начало", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Интервалы.Колонки.Добавить("Окончание", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Возврат Интервалы;

КонецФункции

Функция СекундВЧасе()

	Возврат 3600;

КонецФункции

Функция ЗнаковЧасов()

	Возврат 2;

КонецФункции

#КонецОбласти
